app/controllers/emprendimientos_controller.rb

  def index
    @emprendimientos = Emprendimiento.all
---
SELECT "emprendimientos".* FROM "emprendimientos"

  def create
    @emprendimiento = Emprendimiento.new(emprendimiento_params)

    respond_to do |format|
      if @emprendimiento.save
---
INSERT INTO "emprendimientos" ("titulo", "descripcion", "etiquetas", "correo", "pweb", "pface", "ptwitter", "pinstagram", "pbehance", "pyoutube", "plinkedin", "ihoraio", "fhorario", "telefono", "direccion", "lvideo", "portada_file_name", "portada_content_type", "portada_file_size", "portada_updated_at", "logo_file_name", "logo_content_type", "logo_file_size", "logo_updated_at", "producto1_file_name", "producto1_content_type", "producto1_file_size", "producto1_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @emprendimiento.update(emprendimiento_params)
---
UPDATE "emprendimientos" SET "lvideo" = ?, "updated_at" = ? WHERE "emprendimientos"."id" = ?  [["lvideo", "https://www.youtube.com/watch?v=oNWOC_Pvo4w"], ["updated_at", "2017-05-04 17:14:47.179827"], ["id", 7]]

  def destroy
    @emprendimiento.destroy
---
DELETE FROM "emprendimientos" WHERE "emprendimientos"."id" = ?  [["id", 1]]

    def set_emprendimiento
      @emprendimiento = Emprendimiento.find(params[:id])
---
SELECT  "emprendimientos".* FROM "emprendimientos" WHERE "emprendimientos"."id" = ? LIMIT 1  [["id", 1]]